app/views/episodes/show.html.erb

              <div id="comment-overview">
                <div id="author-thumbnail"><%= link_to (image_tag User.find(comment.user_id).avatar.thumb, id: "artist-thumbnail", alt: "user-thumbnail"), users_path(User.find(comment.user_id)) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]