app/controllers/comments_controller.rb

SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "episode_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "prova 2"], ["episode_id", 1], ["user_id", 1], ["created_at", "2018-03-30 14:43:52.792661"], ["updated_at", "2018-03-30 14:43:52.792661"]]
---
  def create
  	@episode = Episode.find(params[:episode_id])
  	input = comment_params.merge(episode: @episode)
    	@comment = current_user.comments.build(input)
	@comment = @episode.comments.build(input)
	@comment.user=current_user
    if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 4]]
---
    def destroy
    Comment.find(params[:id]).destroy

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "prova prova bla ba mod"], ["updated_at", "2018-03-30 15:01:24.273127"], ["id", 3]]
---
  def update
    @comment = Comment.find(params[:id])

    if @comment.update_attributes(comment_params)

SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", 7]]
---
def find_episode
		@episode = Episode.find(params[:episode_id])