app/controllers/episodes_controller.rb

	def show
		@episode = Episode.find(params[:id])
---
SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", 0]]

  def edit
    @episode = Episode.find(params[:id])
---
SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", 6]]

	def destroy

    		Episode.find(params[:id]).destroy
---
DELETE FROM "episodes" WHERE "episodes"."id" = ?  [["id", 5]]
SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", 5]]

  	def update
   	 @episode = Episode.find(params[:id])
    	if @episode.update_attributes(episode_params)
---
SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "episodes" SET "name" = ?, "description" = ?, "mp3_file_name" = ?, "mp3_file_size" = ?, "updated_at" = ? WHERE "episodes"."id" = ?  [["name", "name"], ["description", "descr"], ["mp3_file_name", "Deadpool_2__The_Trailer.mp3"], ["mp3_file_size", 3822583], ["updated_at", "2018-03-30 13:12:11.412736"], ["id", 2]]

	def create
		@episode= Episode.new
		if (!params[:episode][:name].present? or params[:episode][:description].nil?)

      		flash[:danger] = "Error in creating the episode!"
  			render 'new'
	  	else
	    	#@episode = current_user.podcasts.create(podcast_params)
	    	#@episode = @podcast.episodes.create(episode_params)
	    	  	@podcast = Podcast.find(params[:podcast_id])
  				input = episode_params.merge(podcast: @podcast)
				@episode = @podcast.episodes.build(input)
	    	#@podcast.user_id= current_user.id
	    if @episode.save
---
SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "episodes" ("name", "description", "mp3_file_name", "mp3_content_type", "mp3_file_size", "image", "podcast_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def vote
    @episode = Episode.find(params[:id])
---
SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", 3]]

	def find_podcast
		@podcast = Podcast.find(params[:podcast_id])
---
SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT 1  [["id", nil]]