app/controllers/podcasts_controller.rb

SELECT "podcasts".* FROM "podcasts" WHERE (lower(artist) LIKE ?, "%#{search.to_s.downcase}%")
---
	def index
		unless podcast_index_params[:search].nil?
			@podcasts = Podcast.find_by_title(params[:search]).paginate(:page => params[:page])
		else
			@podcasts = Podcast.paginate(:page => params[:page])

INSERT INTO "podcasts" ("name", "description", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "adasd"], ["description", "asdasdas"], ["artist_id", 1], ["created_at", "2018-03-30 13:13:26.545589"], ["updated_at", "2018-03-30 13:13:26.545589"]]
---
	def create
		@podcast = Podcast.create(podcast_params)

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "episodes".* FROM "episodes" WHERE "episodes"."podcast_id" = ? LIMIT 15 OFFSET 0  [["podcast_id", 7]]
---
	def show
		@podcast = Podcast.find(params[:id])
		@artist = Artist.find(@podcast.artist_id)
		@episodes = @podcast.episodes.paginate(:page => params[:page])

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT 1  [["id", 2]]
---
	def edit
		@podcast = Podcast.find(params[:id])

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "podcasts" SET "name" = ?, "description" = ?, "image" = ?, "updated_at" = ? WHERE "podcasts"."id" = ?  [["name", "podcast di prova modificato"], ["description", "questo podcast è stato creato come prova modific"], ["image", "index.png"], ["updated_at", "2018-03-27 08:44:55.174048"], ["id", 1]]
---
	def update
		@podcast = Podcast.find(params[:id])

		if @podcast.update(podcast_params)

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "podcasts" WHERE "podcasts"."id" = ?  [["id", 3]]
---
	def destroy
		@podcast = Podcast.find(params[:id])
		@podcast.destroy!