app/views/podcasts/index.html.erb

	            <h2><%= pod.title %></h2>
	            <p class="episode-count"><%= pod.episodes.count %> episodes</p>
---
SELECT COUNT(*) FROM "episodes" WHERE "episodes"."podcast_id" = ?  [["podcast_id", 1]]